app/views/shared/_form.html.haml


        - group.users.each do |user|
---
SELECT `users`.id FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1