app/controllers/groups_controller.rb

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('漢方薬', '2020-02-10 08:07:01', '2020-02-10 08:07:01')
---
  def create
    @group = Group.new(group_params)
    if @group.save

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def edit
    @group = Group.find(params[:id])

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `name` = 'ご当地', `updated_at` = '2020-02-10 10:31:48' WHERE `groups`.`id` = 1
---
  def update
    @group = Group.find(params[:id])
    if @group.update(group_params)